export const URL="";
export const BITDEFAULTDEV=2;
export const CODEDEFAULTDEV=4;
export const SCROLLBOTTOM=100;
export const DEFMINUTER=3;
export const DEFSENCOD=59;
export const DEFOPERATORS=["CHN","UNI","CMN"];
export const DEFOPERATORSOBJ={
    "中国电信":"CHN",
    "中国联通":"UNI",
    "中国移动":"CMN"
};
//省份
export const PROVICES={
    "BJ":"北京",
    "TJ":"天津",
    "HE":"河北",
    "SX":"山西",
    "LN":"辽宁",
    "NM":"内蒙古",
    "JL":"吉林",
    "HL":"黑龙江",
    "SH":"上海",
    "JS":"江苏",
    "ZJ":"浙江",
    "AH":"安徽",
    "FJ":"福建",
    "JX":"江西",
    "SD":"山东",
    "HA":"河南",
    "HB":"湖北",
    "HN":"湖南",
    "GD":"广东",
    "GX":"广西",
    "HI":"海南",
    "CQ":"重庆",
    "SC":"四川",
    "GZ":"贵州",
    "YN":"云南",
    "XZ":"西藏",
    "SN":"陕西",
    "GS":"甘肃",
    "QH":"青海",
    "NX":"宁夏",
    "XJ":"新疆",
    "HK":"香港",
    "MC":"澳门",
    "TW":"台湾"
};
//运营商
export const OPERATORS ={
    "CHN":"中国电信",
    "UNI":"中国联通",
    "CMN":"中国移动",
    "CTT":"中国铁通",
    "CER":"中国教育",
    "GWB":"长城宽带",
    "BNN":"方正宽带",
    "CST":"中国科技",
    "BGC":"歌华有线",
    "WAS":"华数有线",
    "RFT":"广电网",
    "CNE":"中企通信",
    "ALY":"阿里云",
    "BWN":"京宽网络",
    "FLC":"中电飞华",
    "TPW":"天威视讯",
    "OCN":"东方有线",
    "GDC":"珠江宽频",
    "JSC":"江苏有线",
    "HNC":"湖南有线",
    "GDC":"广东有线",
    "GGL":"谷歌公司",
    "360":"360",
    "GDC":"视讯宽带",
    "EHN":"广州e家宽",
    "HGC":"和记电讯",
    "KJN":"北京宽捷",
    "SXT":"北京三信时代",
    "SNN":"光环新网",
    "CNE":"中信网络",
    "FRG":"国外"
};
export const statusCode=["200_6", "301_2", "404", "403", "5xx"];
//数据层级
export const LEVEL={
    "1/3":"1/3",
    "2/3":"2/3",
    "3/3":"3/3"
};
//查询类型
export const TYPE={
    "hls":"hls",
    "rtmp":"rtmp",
    "flv":"flv"
};



//校验正则
export const LINUXPATH=/^((((\/)|(\.\/)){0,1}|(\.\.\/)*)([\w-][\/]{0,1})+)*$/;
//泛域名
export const PANURL=/^(([a-zA-Z0-9]+:)?\/\/)?(?:\S+(?::\S*)?@)?(?:(?!(?:10|127)(?:\.\d{1,3}){3})(?:[1-9]\d?|1\d\d|2[01]\d|22[0-3])(?:\.(?:1?\d{1,2}|2[0-4]\d|25[0-5])){2}(?:\.(?:[1-9]\d?|1\d\d|2[0-4]\d|25[0-4]))|(?:(\*{1}|(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+))(?:\.(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)*(?:\.(?:[a-z\u00a1-\uffff]{2,})).?)(?::\d{2,5})?(?:[/?#]\S*)?$/;

export const PANURLLIST = /^(((?:(?:(?:https?|ftp):)?\/\/)?(?:\S+(?::\S*)?@)?(?:(?!(?:10|127)(?:\.\d{1,3}){3})(?:[1-9]\d?|1\d\d|2[01]\d|22[0-3])(?:\.(?:1?\d{1,2}|2[0-4]\d|25[0-5])){2}(?:\.(?:[1-9]\d?|1\d\d|2[0-4]\d|25[0-4]))|(?:(\*{1}|(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+))(?:\.(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)*(?:\.(?:[a-z\u00a1-\uffff]{2,})).?)(?::\d{2,5})?(?:[/?#]\S*)?)|((?:(?:(?:https?|ftp):)?\/\/)?(?:\S+(?::\S*)?@)?(?:(?!(?:10|127)(?:\.\d{1,3}){3})(?:[1-9]\d?|1\d\d|2[01]\d|22[0-3])(?:\.(?:1?\d{1,2}|2[0-4]\d|25[0-5])){2}(?:\.(?:[1-9]\d?|1\d\d|2[0-4]\d|25[0-4]))|(?:(\*{1}|(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+))(?:\.(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)*(?:\.(?:[a-z\u00a1-\uffff]{2,})).?)(?::\d{2,5})?(?:[/?#]\S*)?)([\r\n]((?:(?:(?:https?|ftp):)?\/\/)?(?:\S+(?::\S*)?@)?(?:(?!(?:10|127)(?:\.\d{1,3}){3})(?:[1-9]\d?|1\d\d|2[01]\d|22[0-3])(?:\.(?:1?\d{1,2}|2[0-4]\d|25[0-5])){2}(?:\.(?:[1-9]\d?|1\d\d|2[0-4]\d|25[0-4]))|(?:(\*{1}|(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+))(?:\.(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)*(?:\.(?:[a-z\u00a1-\uffff]{2,})).?)(?::\d{2,5})?(?:[/?#]\S*)?))+)$/i;
//export const PANURL=/^(([a-zA-Z0-9]+:)?\/\/)?(?:\S+(?::\S*)?@)?(?:(?!(?:10|127)(?:\.\d{1,3}){3})(?!(?:169\.254|192\.168)(?:\.\d{1,3}){2})(?!172\.(?:1[6-9]|2\d|3[0-1])(?:\.\d{1,3}){2})(?:[1-9]\d?|1\d\d|2[01]\d|22[0-3])(?:\.(?:1?\d{1,2}|2[0-4]\d|25[0-5])){2}(?:\.(?:[1-9]\d?|1\d\d|2[0-4]\d|25[0-4]))|(?:(\*{1}|(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+))(?:\.(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)*(?:\.(?:[a-z\u00a1-\uffff]{2,})).?)(?::\d{2,5})?(?:[/?#]\S*)?$/;
